# coding: utf-8
from enum import Enum, unique


# 身份类型
@unique
class UserType(Enum):
    """
    说明：身份类型枚举类
    --------------------------------
    修改人    修改日期         修改原因
    --------------------------------
    王建彬    2018-10-17
    --------------------------------
    """
    Stu = 1  # 学生
    Tea = 3  # 教师
    All = (1, 3)


# 学生科目类型
@unique
class StuCodeType(Enum):
    """
    说明：学生科目类型枚举类
    --------------------------------
    修改人    修改日期         修改原因
    --------------------------------
    王建彬    2018-10-17
    --------------------------------
    """
    Math = 'A'
    Eng = 'D'
    Chn = 'E'
    Phy = 'B'
    Cem = 'C'
    All = ('A', 'B', 'C', 'D', 'E')


# 教师科目类型
@unique
class TeaCodeType(Enum):
    """
    说明：教师科目类型枚举类
    --------------------------------
    修改人    修改日期         修改原因
    --------------------------------
    王建彬    2018-10-17
    --------------------------------
    """
    Math = 'J'
    Eng = 'M'
    Cn = 'N'
    Phy = 'K'
    Cem = 'L'
    All = ('J', 'K', 'L', 'M', 'N')
